Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: I lived such a busy life, with no time to even reminisce on the past.
es_419: Llevaba una vida muy ocupada y no tenía tiempo ni para rememorar el pasado.

source: end this interaction right now.
es_419: Termina esa interacción ahora mismo.

source: including respawn times, farming a hundred times would take...
es_419: Si se cuenta lo que tardan en reaparecer, matarlos cien veces llevaría…

source: unless there was some kind of bug, they can’t escape.
es_419: A menos que haya alguna falla, no pueden escapar.

source: doesn’t that sound like a great offer, sir?
es_419: ¿No le parece una gran propuesta, señor?

source: shut up.
es_419: Cállate.

source: they were all at my feet, I tell you!
es_419: ¡Les digo que estaban todos a mis pies!

source: oh?
es_419: ¿Eh?

source: your payment is complete!
es_419: ¡Se ha completado el pago!

source: that was just a figure of speech.
es_419: Era solo una expresión.

source: ugh, I can’t stand you sometimes.
es_419: Agh, a veces no te soporto.

source: n-no way...
es_419: ¡N-no puede ser!

source: and we’re back!
es_419: ¡Y regresamos!

source: I’m back for round two.
es_419: Vine por el segundo round.

source: that all of your efforts up until now...
es_419: … de que todos tus esfuerzos hasta ahora…

source: accept
es_419: ACEPTAR

source: hehehehe!
es_419: ¡Je, je, je, je!

source: dash
es_419: FUSH

source: so screw off, you disgusting roach.
es_419: Así que lárgate, cucaracha asquerosa.

source: get them up!
es_419: ¡Levántenlos!

source: s-sir!
es_419: ¡S-Señor!

source: it was my fault that you got caught up in all of this.
es_419: Fue mi culpa que te involucraras en todo esto.

source: are you finally up?
es_419: ¿Por fin despertaste?

source: ...that there's a region that's considered the "area of forbidden goods".
es_419: … que hay una región que se considera “la zona de los objetos prohibidos".

source: hum hum~♬
es_419: Tara rará

source: to be honest,
es_419: Para ser sincero,

source: and the most talented singer-songwriter of our age!
es_419: ¡Y la compositora más talentosa de nuestra era!

source: umm... so...
es_419: Bueno… yo…

source: I will be the one to eliminate all humans.
es_419: Yo seré quien elimine a todos los humanos.

source: but ironically enough, it was her parents that got her through it.
es_419: Pero, irónicamente, fueron sus padres los que la ayudaron a salir adelante.

source: how does she have items like that?
es_419: ¿Cómo es que tiene todo eso?

source: we were... too hard on you, weren’t we?
es_419: Fuimos… muy duros contigo, ¿no es así?

source: "the voice of an angel."
es_419: “La voz de un ángel”.

source: that was [steal], a skill used by the thief class.
es_419: La de [robar]. Es una habilidad de la clase ladrón.

source: I was just a little annoyed, so I couldn’t help myself.
es_419: Pero estaba un poco molesta, así que no pude contenerme.

source: why does this only work when I’m leveling up this crap noob item?
es_419: ¿Por qué esto solo funciona cuando quiero mejorar esta porquería de arma de principiante?

source: I’m sure you understand what I’m saying.
es_419: Sé que entiendes lo que digo.

source: what is this place?
es_419: ¿Qué es este lugar?

source: and if I do that, I can relax and enjoy my fantasy lif--
es_419: Y si hago eso, puedo relajarme y disfrutar mi vida de fan…

source: o-over there, boss!
es_419: ¡A-allí, jefe!

source: and I used it to get rid of anyone who pissed me off.
es_419: Y lo usé para acabar con todos los que me hicieron cabrear.

source: and just for reference...
es_419: Y para que sepas…

source: I know I said I’d boost you, but are you just going to sit back and watch?!
es_419: Sé que dije que te ayudaría, pero ¡¿te vas a quedar ahí sin hacer nada?!

source: the world guild alliance.
es_419: Alianza mundial de gremios

source: I actually got some money from my parents yesterday.
es_419: De hecho, ayer mis padres me dieron dinero.

source: f*ck, that scared me.{j}hh
es_419: M*erda, eso me asustó.

source: Staff KongsnaㆍWallabiㆍJaehyeon lee
es_419: Equipo: KongsnaㆍWallabiㆍJaehyeon lee

source: reality
es_419: REALIDAD

source: eek?!
es_419: ¡¿Aaj?!

source: ding ding ding ding ding ding
es_419: PLIN PLIN PLIN PLIN PLIN PLIN

source: and once the cash completely stopped flowing in...
es_419: Y cuando dejó de ingresar dinero…

source: wait! they just posted something!
es_419: ¡Esperen! ¡Acaban de publicar algo!

source: I’ll make it short.
es_419: Seré breve.

source: it’s so bad that no one can get through to our 1:1 customer service phone lines!
es_419: ¡La situación es tan mala que nadie puede comunicarse con nuestras líneas de atención personalizada!

source: our developers are currently checking the servers.
es_419: Los desarrolladores están revisando el servidor.

source: you’re the one who killed everyone.
es_419: Tú fuiste quien mató a todos.

source: excitement?
es_419: ¿Emoción?

source: total spent
es_419: TOTAL GASTADO

source: major broadcasting networks stopped reaching out to cast sarang.
es_419: Las cadenas de televisión más importantes ya no llamaban para contratarla.

source: I must’ve accidentally stepped on it.
es_419: Debo haberla pisado accidentalmente.

source: as the people who run the game, this is the most natural course of action for us.
es_419: Como responsables del juego, este es el modo de proceder más natural para nosotros.

source: *about 400,000 usd (exchange rate as of jun 2022)
es_419: *Unos 400 000 USD (al cambio de junio de 2022)

source: us game developers have no say in how our users play the game.
es_419: Los desarrolladores como nosotros no debemos opinar sobre cómo juegan los usuarios.

source: episode 14. character deleted (2)
es_419: Episodio 14: Personaje eliminado (2)

source: Although once ignored and deprecated, Jiwoo becomes the most powerful character when he gets possession of a wooden stick – that is, a +99 reinforced wooden stick that is able to split a world in half with just once swing.
es_419: Aunque alguna vez lo ignoraron y lo despreciaron, Jiwoo se convierte en el personaje más poderoso cuando llega a sus manos un palo de madera… es decir, un palo de madera +99, capaz de partir al mundo en dos de un solo golpe.

source: the mob respawned.
es_419: Las bestias reaparecieron.

source: seems about right.
es_419: Parece acertado.

source: aside from that cape and wooden stick!
es_419: ¡Salvo por esa capa y el palo de madera!

source: sigh...
es_419: Uff…

source: but what I do know is that they’ll be back.
es_419: pero lo que sí sé es que regresarán.

source: ...sarang’s parents...
es_419: … los padres de Sarang…

source: ...most of these cells were already completely fused into urakan’s body.
es_419: … la mayoría de esas células ya estaban completamente fusionadas en el cuerpo de Urakan.

source: I’m here to confiscate your wooden stick.
es_419: Vine a confiscar tu palo de madera.

source: you think I’m going to go down without a figh--
es_419: ¿Creen que me iré sin pelear…?

source: [a million strikes] strike without killing version
es_419: [Un millón de golpes], versión golpear sin matar.

source: what the...
es_419: ¿Qué demo…?

source: ...that I hold in my hands for your keeping.
es_419: … que tengo entre mis manos para que sea tuya.

source: I realized you weren’t around.
es_419: Me di cuenta de que no estabas.

source: you suck as a commander.{j}jo
es_419: Eres un comandante horrible.

source: ...and even filmed tons of commercials.
es_419: … y hasta grabó cientos de publicidades.

source: w-well, it’s quite a complicated story...
es_419: B-bueno, es una historia bastante compleja…

source: ...ten billion gold!
es_419: … ¡de diez mil millones en oro!

source: more
es_419: MÁS

source: babe, stop it.
es_419: Basta, cariño.

source: I’ve got everything I possibly could.
es_419: Tengo todo lo que podría tener.

source: quest complete!
es_419: ¡Misión cumplida!

source: and who is this "furry guy" he mentioned?
es_419: ¿Y a quién se refería con “peludito”?

source: it’s not just the customer service hotlines, but people are posting on places like gaming forums, utube, and live streams...
es_419: ¡Y no solo en las líneas de atención al cliente! La gente también está publicando en foros de juegos, en Utube y streams en vivo…

source: I bought the 55,000 won beginner warrior package.
es_419: Compré el “Paquete de guerrero principiante” de 55 000 wones.

source: spear of the ascended
es_419: Lanza de los Ascendidos.

source: oh, my. thank you!
es_419: Vaya. ¡Gracias!

source: what the uf48482@$$rjkf!?!
es_419: Pero ¡¿qué uf48482@$$rjkf?!

source: I definitely practiced something.
es_419: Practiqué un poco, ya lo creo.

source: again!
es_419: ¡Otra vez!

source: that’s when I finally came across...
es_419: Fue entonces cuando finalmente conocí…

source: I guess so.
es_419: Supongo que sí.

source: his name is...
es_419: Su nombre es…

source: wh-why does this wooden stick suddenly have a face?!
es_419: ¡¿P-por qué de repente este palo tiene cara?!

source: you really are annoying.
es_419: Eres muy molesta.

source: just get rid of this rude wench.
es_419: Deshágase de esta bruja maleducada.

source: p-pardon?
es_419: ¿P-Perdón?

source: which means that in the end, he would have lost out on 200 dollars.
es_419: Lo que significa que, al final, habría perdido 200 dólares.

source: now your little wooden stick...
es_419: Ahora tu pequeño palo de madera…

source: how have you been?
es_419: ¿Cómo has estado?

source: with this?
es_419: ¿Con esto?

source: go, go, go!{j}tr
es_419: ¡Duro, duro, duro!

source: I miss my mommy.
es_419: Extraño a mi mami.

source: let’s not drag this storyline along.{j}I’ll finish you quick.
es_419: No sigamos estirando las cosas. Los liquidaré enseguida.

source: the five strongest guilds in the world...
es_419: Los cinco gremios más poderosos del mundo…

source: basic swordsman skill
es_419: Habilidad básica de espadachín

source: quite a feat you’ve accomplished.
es_419: Vaya hazaña que has logrado.

source: Illustrated by shurishu
es_419: Ilustración de Shurishu

source: nearby front village the starting dungeon
es_419: CERCA DE LA ALDEA FRONT LA MAZMORRA INICIAL

source: so luv got...
es_419: Entonces, a Amor…

source: rahhhhh!
es_419: ¡Graaaaa!

source: I’ve tried tons of games after that, and they were all the same.
es_419: Probé cientos de juegos después de eso, y todos eran iguales.

source: to the center of the forest, where there’s no one around.
es_419: Al medio del bosque, donde no hay nadie.

source: only your love!
es_419: ¡Solo su amor!

source: how dare you step foot in here?!
es_419: ¡¿Cómo te atreves a poner un pie aquí?!

source: current weapon...
es_419: Arma actual…

source: did you not see the game’s announcement?{j}ff
es_419: ¿No viste el anuncio del juego?

source: but even just that...
es_419: Pero incluso eso solo…

source: and then disappeared without even explaining anything.
es_419: Pero desapareció sin dar explicaciones.

source: on top of that, he’s a [master novice]?
es_419: Y encima, ¿es un [maestro novato]?

source: ...I can finally live my secretly op persona?!
es_419: … ¡¿que por fin podré usar mi imagen SP secreta?!

source: y-you lured me here?
es_419: ¿M-me engañaste?

source: dad...?
es_419: ¿Papá…?

source: wait a minute!
es_419: ¡Un momento!

source: why’d you run away like that?
es_419: ¿Por qué te fuiste de esa manera?

source: oh, my!
es_419: ¡Ay, no!

source: she has on a total of 100 million gold.
es_419: Todo suma en total 100 millones en oro.

source: go get more money from your parents and use it to reinforce those crap weapons of yours.
es_419: Ve a sacarles más plata a tus padres y úsala para mejorar esas armas de m*erda que tienes.

source: they have also not broken any in-game rules.
es_419: Tampoco violó ninguna regla del juego.

source: huh?!
es_419: ¡¿Eh?!

source: the entire world guild alliance...
es_419: Toda la alianza mundial de gremios…

source: wh-what is this?
es_419: ¿Q-qué es esto?

source: humans look down on opponents that appear weak.
es_419: Los humanos menosprecian a los oponentes que parecen débiles.

source: I spent so much on in-app purchases to get this!
es_419: ¡Gasté un montón en la aplicación del juego para comprarla!

source: this is so damn fun!!!
es_419: ¡¡¡Esto es tan divertido!!!

source: I thought characters like weren’t allowed to talk about things outside of the game world.
es_419: Creía que no podían hablar de cosas que no fueran del mundo del juego.

source: chrono life’s most powerful player
es_419: El jugador más poderoso de Chrono Life

source: w-why, though?!
es_419: Pero ¡¿por qué?!

source: but then again, I’m the first person to ever have an ascended weapon.
es_419: Igual, soy la primera persona que tiene un arma ascendida.

source: nice to meet y--
es_419: Encantado de conocer…

source: I’m sarang han!
es_419: ¡Soy Sarang Han!

source: I just... don’t understand.
es_419: No… no lo comprendo.

source: creature of despair therberus
es_419: Bestia de la desesperación Therberus

source: on top of that, there was the exp from slaying all members of the world guild alliance, which amounts to approximately three million users.
es_419: Además de eso, obtuvo experiencia por matar a todos los miembros de la alianza mundial de gremios, que eran unos tres millones de usuarios.

source: ...there was an interesting lecture at harvard university.
es_419: … hubo una charla interesante en la Universidad de Harvard.

source: you have reached the maximum level.
es_419: Has llegado al nivel máximo.

source: after that day...
es_419: Después de ese día…

source: I’m going to use an actual [skill].
es_419: voy a utilizar una [habilidad].

source: you have logged out.
es_419: Te has desconectado.

source: ...we’ve got on our hands an example of the best and worst possible character ever.
es_419: … tenemos entre manos un ejemplo del peor y el mejor personaje de todos.

source: blech!
es_419: ¡Bleh!

source: current online users:{j}1
es_419: Usuarios en línea: 1

source: ...to the hidden class of [goddess of life].
es_419: Pasé a la clase secreta de [Diosa de la vida].

source: ...I break that mirror too?
es_419: … si rompo ese espejo también?

source: and you end up losing everything.
es_419: Y terminas perdiéndolo todo.

source: got it?!
es_419: ¡¿Entendido?!

source: "captain luv"?
es_419: ¿”Capitana Amor”?

source: is this any way to run a business?!
es_419: ¡¿Así maneja su negocio?!

source: goooooo!{j}17
es_419: ¡Vamoooos!

source: hallasan guild’s base
es_419: Sede del Gremio de Hallasan

source: spring
es_419: ZAS

source: goooooo!{j}e3
es_419: ¡Vamoooos!

source: chrono life is the best game ever!
es_419: ¡Chrono Life es el mejor juego de todos!

source: perfect.
es_419: Perfecto.

source: how did I even end up in this situation?!
es_419: ¡¿Cómo es que terminé en esta situación?!

source: an sss-class bounty has been put out across the nation!
es_419: ¡Se ofrece una recompensa clase-SSS en todo el país!

source: he must be going through something.
es_419: Debe tener un mal día.

source: f*ck off, noob!
es_419: ¡Vete a la m*erda, novata!

source: oh, man. that took me by surprise.
es_419: Vaya, eso me tomó por sorpresa.

source: hahahahahahaha, you guys are ridiculous. hahahahaha!
es_419: Ja, ja, ja, ja, ja, ja, ja, qué ridículos son. ¡Ja, ja, ja, ja, ja!

source: heh... heh...
es_419: Je, je…

source: revenge
es_419: Venganza

source: fairy tales?
es_419: ¿Cuentos de hadas?

source: advancement complete.
es_419: Avance completo.

source: "swing down".
es_419: “Golpe hacia abajo”.

source: where you going?
es_419: ¿Adónde vas?

source: I’ve already taken care of three missions.
es_419: Yo ya completé tres misiones.

source: who is it?
es_419: ¿Quién es?

source: you’re just an npc. and of a different game, no less...
es_419: Solo eres un PNJ. Y, además, de otro juego…

source: the employees of chrono life.
es_419: Los empleados de Chrono Life.

source: it’s an amazing fantasy world that everyone has dreamed of at least once in their life.
es_419: Es un mundo de fantasía increíble con el que todos han soñado al menos una vez en su vida.

source: ahh...
es_419: Aah…

source: didn’t I tell you just now?
es_419: ¿No te lo dije hace un momento?

source: hey, urus! what’s up?
es_419: ¡Hola, Urus! ¿Qué tal?

source: attack!
es_419: ¡Al ataque!

source: but once I realized it...
es_419: Para cuando me di cuenta…

source: boss...
es_419: Jefe…

source: pleased to meet you, brave warrior.
es_419: Encantado de conocerte, valiente guerrero.

source: no matter how much time passes,
es_419: No importa cuánto tiempo pase…

source: why would you go in by yourself like that?! are you trolling us or what?!
es_419: ¡¿Por qué avanzaste sola así?! ¡¿Nos estás troleando o qué?!

source: looks like my story’s taking a huge turn.
es_419: Parece que mi historia dio un gran giro.

source: d-durability, you say?!
es_419: ¡¿Durabilidad, dijo?!

source: it feels like the wh-whole continent is shaking!
es_419: ¡Se siente como si todo el continente temblara!

source: I saved her earlier by getting rid of all of those monsters in one swing.
es_419: Hace un rato la salvé cuando maté a todos esos monstruos de un solo golpe.

source: I want to give you the same freedom for your game experience.
es_419: Quiero darles esa misma libertad en el juego.

source: it felt as if I had reunited with my first love.
es_419: Sentí como si me reencontrara con mi primer amor.

source: it’s going to hurt.
es_419: Te va a doler.

source: I-I’m so sorry for your inconvenience!
es_419: ¡L-lamento mucho las molestias!

source: but that’s still not going to be enough to kill me.
es_419: Pero aún no es suficiente para matarme.

source: this is all I need.
es_419: Esto es todo lo que necesito.

source: your stats have decreased.
es_419: Han bajado tus atributos.

source: I’ll see you next time.
es_419: Nos veremos la próxima.

source: even down to the undies.
es_419: Hasta tiene sus calzoncillos.

source: ...you really are strong, huh?
es_419: Realmente eres muy fuerte, ¿eh?

source: silence.
es_419: Silencio…

source: ...but even high-level users roam the area.
es_419: … sino también jugadores de alto rango que andan por la zona.

source: I have a feeling he’s the reason all of the monsters from the ravine of the deceased disappeared.
es_419: Presiento que él es la causa de la desaparición de los monstruos del Valle de los Muertos.

source: who could be the hunky dude that’s captured our little sarang’s heart?
es_419: ¿Quién será el galán que cautivó el corazón de Sarang?

source: raaaaaaaaah!
es_419: ¡GRRRRRR!

source: it’s me, sir.
es_419: Soy yo, señor.

source: urus’ lost head urakan{j}
es_419: La cabeza perdida de Urus URAKAN

source: whoa...
es_419: Uooo…

source: current str 23
es_419: Fuerza actual 23

source: looks like this is going to take a while to fix.
es_419: Creo que me llevará un tiempo arreglarlo.

source: a +99 reinforced wooden stick?
es_419: ¿Un palo de madera +99?

source: everyone, just calm down.
es_419: Cálmense todos.

source: ...your level would technically be three times higher than them!
es_419: … técnicamente, ¡usted tendría tres veces más su nivel!

source: she entered the music industry at a young age.
es_419: Entró de muy joven a la industria musical.

source: hahaha! what are you talking about?
es_419: ¡Ja, ja, ja! ¿De qué hablas?

source: it’s slaughter time.
es_419: Es hora de matar.

source: don’t talk to me like that.
es_419: No me hables así.

source: ...the lost head of urus.
es_419: … la cabeza perdida de Urus.

source: I’m just scared people are going to find out about the real you!
es_419: ¡Me preocupa que la gente vea cómo eres realmente!

source: I
es_419: ¡Me

source: consumes the enemy to absorb their levels and stats.
es_419: Consume al enemigo para absorber su nivel y atributos.

source: chrono life is seriously the best game ever!
es_419: ¡Chrono Life es realmente el mejor juego de todos!

source: what an arrogant, little human...
es_419: Qué humana más arrogante…

source: after that day, I was so inspired by you that I had a statue made in your liking!
es_419: Después de ese día, me sentí tan inspirado por ti ¡que mandé a hacer tu estatua!

source: there are no excuses here!
es_419: ¡No tienes excusa!

source: you’ve got guts as a bird to be squaring up against a primat--
es_419: Eres un pájaro con agallas para enfrentarte así a un primat...

source: grr?!
es_419: ¡¿Gra?!

source: it’s superstar idol, sarang han!
es_419: ¡Eres la superestrella Sarang Han!

source: this game is done for.
es_419: Este juego está acabado.

source: hahaha
es_419: Ja, ja, ja.

source: but I think we did a really good job at making chrono life into a fun game.
es_419: pero creo que logramos hacer de Chrono Life un juego divertido.

source: read
es_419: Leído

source: you’re not putting all of your ability points into one stat, are you?!
es_419: No estará poniendo todos los puntos en una sola habilidad, ¡¿no?!

source: if you guys keep coming after my boss, luv, you’re going to make it hard for me to keep my secretly op persona.
es_419: Si siguen atacando a mi ama, Amor, se me va a hacer difícil mantener mi imagen SP en secreto.

source: I wonder.
es_419: Es curioso.

source: y{j}yikes lmao
es_419: Cielos, qué risa.

source: that’s not what’s important here!
es_419: ¡Eso no tiene importancia ahora!

source: snatch
es_419: AGARRA

source: ...that means in one hour, he makes about 500 million won*.
es_419: … eso significa que, en una hora, gana cerca de 500 millones de wones*.

source: the hallasan guild,
es_419: ¿El Gremio de Hallasan…

source: phew
es_419: FIU

source: and in the end...
es_419: Y al final…

source: ...all of the monsters of the ravine of deceased were evaporated.
es_419: … y todos los monstruos del Valle de los Muertos se evaporaron.

source: chuckle
es_419: JEJEJE

source: you startled m--
es_419: Me sobresal…

source: hahaha, whatever you say, noob.
es_419: Ja, ja, ja. Como digas, novato.

source: The "user" that has become a hot topic around the world is a completely normal user.
es_419: El "usuario" que se ha convertido en tema candente en todo el mundo es un usuario totalmente normal.

source: slosh
es_419: PLOCH

source: I-I figured you already left.
es_419: P-pensé que ya te habrías ido.

source: totally different people
es_419: SON TOTALMENTE DIFERENTES

source: what’s your character name?
es_419: ¿Cómo se llama tu personaje?

source: now hurry up and sit down. we’ve got less than 10 minutes left!
es_419: Deprisa, siéntate. ¡Nos quedan menos de diez minutos!

source: the highest-ranking player of chrono life, and the supreme commander of the world guild alliance.
es_419: El jugador de más alto rango en Chrono Life y el comandante supremo de la alianza mundial de gremios.

source: bow of the ascended
es_419: Arco de los Ascendidos.

source: just us?
es_419: ¿Nadie más?

source: get up!
es_419: ¡Levántese!

source: that’s you, right?
es_419: Ese eres tú, ¿no?

source: it’s time to make some money.
es_419: Es hora de hacer dinero.

source: a-are you alright?!
es_419: ¡¿E-está bien?!

source: of course she was.
es_419: Claro que sí.

source: singer sarang han
es_419: Sarang Han Cantante

source: h{j}i{j}y{j}a{j}a{j}a
es_419: KIAAAA

source: bow
es_419: REVERENCIA

source: [secret tactic].
es_419: [Técnica secreta].

source: 7:30 pm, right?
es_419: Era a las 19:30, ¿no?

source: a million strikes.
es_419: Un millón de golpes.

source: head of development
es_419: Jefe de desarrolladores

source: and I guarantee that they’re...
es_419: Y te puedo garantizar…

source: in use
es_419: EN USO

source: so the wooden stick boy finally reached the maximum level, eh?
es_419: Así que el chico del palo de madera llegó al nivel máximo, ¿eh?

source: pyuuuu
es_419: PIUUUU

source: oh? where are you going?
es_419: ¿Eh? ¿Adónde vas?
